const passport = require('passport');
const express = require('express');
const controller = require('../controllers/eventForm');

const router = express.Router();

router.use((req, res, next) => {
    next();
});


router.get('/', async (req, res) => {
    // console.log(req.session)
    res.render('events', { layout: 'bootstrap', style: "events.css", title: "Events", script: "events.js",userId: req.session.loggedUserId,
     events:[
         {  
             id : 1,
             title:"ΚΟΚΚΙΝΑ ΦΑΝΑΡΙΑ", 
             date:"30/06/2022",
             image: "https://www.viva.gr/tickets/getattachment/c7fceeb3-d36c-4fd2-bda7-9eb5a6233816/%ce%9a%ce%9f%ce%9a%ce%9a%ce%99%ce%9d%ce%91-%ce%a6%ce%91%ce%9d%ce%91%ce%a1%ce%99%ce%9118c2e6f2-aea8-4c5e-b24f-213e7cc29c1.png",
             description: "Τα «Κόκκινα φανάρια» ανάβουν τα queer φώτα τους στον Cartel Τεχνοχώρο. \n\ \n\
             Η Μαντάμ Παρί και τα κορίτσια της ανοίγουν με γενναιότητα την κουρτίνα του μπαρ τους, αφηγούνται τις ιστορίες τους, χορεύουν, τραγουδούν, ερωτεύονται, ονειρεύονται, ελπίζουν, διαψεύδονται, σκιαγραφώντας έναν κόσμο ζωντανό. Έναν κόσμο παλλόμενο, γεμάτο χρώματα, θραύσματα και σπαράγματα, γεμάτο φως και σκοτάδια, τραύματα και θαύματα. Έναν κόσμο υπαρκτό ανάμεσά μας, όσο κι αν επιλέγουμε ενδεχομένως να αποστρέφουμε το βλέμμα μας, όσο κι αν μας βολεύει ίσως να κάνουμε ότι είναι αόρατος. \n\ \n\
             Μέσα από τις ιστορίες τους, ιστορίες βιωμένες στα μονοπάτια της queer νύχτας και του αγοραίου έρωτα, η Μαντάμ Παρί κι ο Μιχαήλος, η Μαρίνα κι ο Ντορής, η Μυρσίνη, η Ελένη κι ο Πέτρος, η Άννα κι ο Νικόλας, ο Δημήτρης κι η Ρόζα, η Κατερίνα κι ο Φερζά, η Νάντια και ο Σάμι έρχονται στη σκηνή για να δηλώσουν και να μας υπενθυμίσουν την παρουσία τους στη ζωή. \n\ \n\
             Σε μια εποχή μετάβασης, την ώρα που οι εξελίξεις, κοινωνικές και όχι μόνο, καθιστούν ατομικά και συλλογικά αναγκαία την αλλαγή και την πορεία προς μια καλύτερη εκδοχή της ανθρωπότητας, η Ομάδα Cartel ανάβει τα «Κόκκινα φανάρια» της με τρόπο ωμά ρεαλιστικό, σκληρό και την ίδια στιγμή τρυφερό κι ανθρώπινο, θέτοντας για μια ακόμα φορά στον πυρήνα του την αλήθεια.\n\ \n\
             Αυτή που οι ήρωες ζούνε, διεκδικώντας το αυτονόητο: την ορατότητα και την ελεύθερη ανάσα της ύπαρξης. Τον ζωτικό χώρο που όλοι μας, ο καθένας με τον δικό του μοναδικό και διαφορετικό τρόπο, έχουμε ανάγκη.\n\ \n\
             Η παράσταση είναι κατάλληλη για θεατές άνω των 17 ετών. "
            },
            {  
                id : 2,
                title:"ΜΑΤΩΜΕΝΑ ΧΩΜΑΤΑ", 
                date:"20/06/2022",
                image: "https://www.viva.gr/tickets/getattachment/791aac50-97da-4248-bdd3-5c70c390b211/%ce%9c%ce%91%ce%a4%ce%a9%ce%9c%ce%95%ce%9d%ce%91-%ce%a7%ce%a9%ce%9c%ce%91%ce%a4%ce%91c477ae9d-87eb-4766-ba06-a3166f8b5da.png",
                description: "Η παράσταση\n\ \n\
                Η ζωή του Μικρασιάτη Μανώλη Αξιώτη, που αφηγείται τις δοκιμασίες του στα Ματωμένα Χώματα, μεταφέρεται στην κεντρική σκηνή του Δημοτικού Θεάτρου Πειραιά. Με έντονο το στοιχείο της μνήμης, και μέσα από μία έντονη αλληλουχία αφηγήσεων και σκηνών, ο θεατής παρακολουθεί τη ζωή του ήρωα από την ήρεμη αγροτική ζωή στο χωριό Κιρκιντζέ, στα απάνθρωπα τάγματα εργασίας Αμελέ Ταμπουρού, το σκληρό μέτωπο του Αφιόν Καραχισάρ και το προσφυγικό ταξίδι στην Ελλάδα. «Θηρίο είν’ ο άνθρωπος», μονολογεί ο ήρωας, για να περιγράψει όχι μόνο το πόσα μπορεί να αντέξει, αλλά και το πόσα φριχτά μπορεί να πράξει.\n\ \n\
                Σημειώνει ο σκηνοθέτης, Γιώργος Παλούμπης:\n\ \n\
                Καθώς έφυγαν και οι τελευταίοι αυτόπτες μάρτυρες της Μικρασιατικής καταστροφής, μαζί τους έφυγαν και οι ζωντανές μαρτυρίες των γεγονότων. Για πολλούς σύγχρονους ανθρώπους - ειδικά τους νεότερους - εκείνα τα γεγονότα αποτελούν πληροφορίες, ημερομηνίες και ονόματα γραμμένα σε κάποια βιβλία ιστορίας. Το τι πραγματικά βίωσαν οι άνθρωποι εκείνον τον καιρό, είναι ελάχιστοι σήμερα αυτοί που βρίσκονται σε θέση, μέσα στο σύγχρονο τρόπο ζωής, να το νιώσουν και να το καταλάβουν.\n\ \n\
                Τα σπουδαία <<Ματωμένα Χώματα>> της Διδώς Σωτηρίου είναι μια σημαντική κληρονομιά ακριβώς γι' αυτό το λόγο. Το μυθιστόρημα μεταφέρει τον αναγνώστη στην πραγματικότητα της εποχής εκείνης, με τον αέρα, τους ήχους, τις μυρωδιές, τις εικόνες της καθημερινότητας των διαφόρων εθνικοτήτων που ζούσαν στα παράλια της Μικράς Ασίας, όπως επίσης και τον πόνο, τη βία και τις αδυσώπητες συνθήκες του πολέμου. Μέσα από τον κεντρικό αφηγητή του βιβλίου, τον Μανώλη Αξιώτη, ερχόμαστε κοντά στους ανθρώπους εκείνων των ημερών, στα απίστευτα συμβάντα που βίωσαν και στην εσωτερική τους μάχη για τις αξίες της ζωής. Στιγμές αδικίας, προδοσίας, εκμετάλλευσης και στυγνής βαρβαρότητας περνούν καταιγιστικά στο ανάγνωσμα, καθώς και στιγμές βαθιάς φιλίας, κατανόησης και αγάπης."
               }
        ]
    })
});


module.exports = router;