'use strict';
const db = require('better-sqlite3')
const bcrypt = require('bcrypt');
const fs = require('fs');
const sql = new db('database.sqlite');

let data = fs.readFileSync('./database.sql', 'utf8');

data = data.split(';');
// console.log(data)

for (let i of data) {
    // console.log(i + ';')
    if (i === "") {
        continue
    }
    let stmt = sql.prepare(i + ';');
    stmt.run();
}



// Populate admin table with 2 admin users
var adminUsername = ['admin', 'theater'];
var adminPassword = ['admin', 'theater'];

for (let i = 0; i < adminUsername.length; i++) {
    let hashedPassword = bcrypt.hashSync(adminPassword[i], 10);
    let stmt = sql.prepare("INSERT INTO admin VALUES (null, ?, ?)");
    stmt.run(adminUsername[i], hashedPassword);
}

var simpleUsers = ['user1', 'user2', 'user3'];
var simpleUsersEmail = ['user1@gmail.com', 'user2@gmail.com', 'user3@gmail.com']
var simpleUsersPassword = ['user1', 'user2', 'user3'];

for (let i = 0; i < simpleUsers.length; i++) {
    let hashedPassword = bcrypt.hashSync(simpleUsersPassword[i], 10);
    let stmt = sql.prepare("INSERT INTO user VALUES (null, ?, ?, ?)");
    stmt.run(simpleUsers[i], hashedPassword, simpleUsersEmail[i]);
}


var perigrafi1 = "Τα «Κόκκινα φανάρια» ανάβουν τα queer φώτα τους στον Cartel Τεχνοχώρο. \n\ \n\
Η Μαντάμ Παρί και τα κορίτσια της ανοίγουν με γενναιότητα την κουρτίνα του μπαρ τους, αφηγούνται τις ιστορίες τους, χορεύουν, τραγουδούν, ερωτεύονται, ονειρεύονται, ελπίζουν, διαψεύδονται, σκιαγραφώντας έναν κόσμο ζωντανό. Έναν κόσμο παλλόμενο, γεμάτο χρώματα, θραύσματα και σπαράγματα, γεμάτο φως και σκοτάδια, τραύματα και θαύματα. Έναν κόσμο υπαρκτό ανάμεσά μας, όσο κι αν επιλέγουμε ενδεχομένως να αποστρέφουμε το βλέμμα μας, όσο κι αν μας βολεύει ίσως να κάνουμε ότι είναι αόρατος. \n\ \n\
Μέσα από τις ιστορίες τους, ιστορίες βιωμένες στα μονοπάτια της queer νύχτας και του αγοραίου έρωτα, η Μαντάμ Παρί κι ο Μιχαήλος, η Μαρίνα κι ο Ντορής, η Μυρσίνη, η Ελένη κι ο Πέτρος, η Άννα κι ο Νικόλας, ο Δημήτρης κι η Ρόζα, η Κατερίνα κι ο Φερζά, η Νάντια και ο Σάμι έρχονται στη σκηνή για να δηλώσουν και να μας υπενθυμίσουν την παρουσία τους στη ζωή. \n\ \n\
Σε μια εποχή μετάβασης, την ώρα που οι εξελίξεις, κοινωνικές και όχι μόνο, καθιστούν ατομικά και συλλογικά αναγκαία την αλλαγή και την πορεία προς μια καλύτερη εκδοχή της ανθρωπότητας, η Ομάδα Cartel ανάβει τα «Κόκκινα φανάρια» της με τρόπο ωμά ρεαλιστικό, σκληρό και την ίδια στιγμή τρυφερό κι ανθρώπινο, θέτοντας για μια ακόμα φορά στον πυρήνα του την αλήθεια.\n\ \n\
Αυτή που οι ήρωες ζούνε, διεκδικώντας το αυτονόητο: την ορατότητα και την ελεύθερη ανάσα της ύπαρξης. Τον ζωτικό χώρο που όλοι μας, ο καθένας με τον δικό του μοναδικό και διαφορετικό τρόπο, έχουμε ανάγκη.\n\ \n\
Η παράσταση είναι κατάλληλη για θεατές άνω των 17 ετών. ";

var perigrafi2 = "Η παράσταση\n\ \n\
Η ζωή του Μικρασιάτη Μανώλη Αξιώτη, που αφηγείται τις δοκιμασίες του στα Ματωμένα Χώματα, μεταφέρεται στην κεντρική σκηνή του Δημοτικού Θεάτρου Πειραιά. Με έντονο το στοιχείο της μνήμης, και μέσα από μία έντονη αλληλουχία αφηγήσεων και σκηνών, ο θεατής παρακολουθεί τη ζωή του ήρωα από την ήρεμη αγροτική ζωή στο χωριό Κιρκιντζέ, στα απάνθρωπα τάγματα εργασίας Αμελέ Ταμπουρού, το σκληρό μέτωπο του Αφιόν Καραχισάρ και το προσφυγικό ταξίδι στην Ελλάδα. «Θηρίο είν’ ο άνθρωπος», μονολογεί ο ήρωας, για να περιγράψει όχι μόνο το πόσα μπορεί να αντέξει, αλλά και το πόσα φριχτά μπορεί να πράξει.\n\ \n\
Σημειώνει ο σκηνοθέτης, Γιώργος Παλούμπης:\n\ \n\
Καθώς έφυγαν και οι τελευταίοι αυτόπτες μάρτυρες της Μικρασιατικής καταστροφής, μαζί τους έφυγαν και οι ζωντανές μαρτυρίες των γεγονότων. Για πολλούς σύγχρονους ανθρώπους - ειδικά τους νεότερους - εκείνα τα γεγονότα αποτελούν πληροφορίες, ημερομηνίες και ονόματα γραμμένα σε κάποια βιβλία ιστορίας. Το τι πραγματικά βίωσαν οι άνθρωποι εκείνον τον καιρό, είναι ελάχιστοι σήμερα αυτοί που βρίσκονται σε θέση, μέσα στο σύγχρονο τρόπο ζωής, να το νιώσουν και να το καταλάβουν.\n\ \n\
Τα σπουδαία <<Ματωμένα Χώματα>> της Διδώς Σωτηρίου είναι μια σημαντική κληρονομιά ακριβώς γι' αυτό το λόγο. Το μυθιστόρημα μεταφέρει τον αναγνώστη στην πραγματικότητα της εποχής εκείνης, με τον αέρα, τους ήχους, τις μυρωδιές, τις εικόνες της καθημερινότητας των διαφόρων εθνικοτήτων που ζούσαν στα παράλια της Μικράς Ασίας, όπως επίσης και τον πόνο, τη βία και τις αδυσώπητες συνθήκες του πολέμου. Μέσα από τον κεντρικό αφηγητή του βιβλίου, τον Μανώλη Αξιώτη, ερχόμαστε κοντά στους ανθρώπους εκείνων των ημερών, στα απίστευτα συμβάντα που βίωσαν και στην εσωτερική τους μάχη για τις αξίες της ζωής. Στιγμές αδικίας, προδοσίας, εκμετάλλευσης και στυγνής βαρβαρότητας περνούν καταιγιστικά στο ανάγνωσμα, καθώς και στιγμές βαθιάς φιλίας, κατανόησης και αγάπης.";

var perigrafi3 = "Ένα από τα τρία έργα γυναικών του ποιητή, μαζί με τις Εκκλησιάζουσες και τη Λυσιστράτη. Μία προσπάθεια του Αριστοφάνη να παρωδήσει τον μεγάλο Ευριπίδη, με βάση την συμπεριφορά των Αθηναίων γυναικών στην διάρκεια μιας μεγάλης μυστικιστικής γιορτής αποκλειστικά γυναικείας, τα Θεσμοφόρια.\n\ \n\
Κατάθεση πολιτική και άκρως κωμική ταυτόχρονα.\n\ \n\
Ο Αριστοφανικός λόγος, πάντα επίκαιρος και ηθογραφικός, μας θυμίζει ότι, ενώ έχουμε προοδεύσει σε διάφορους τομείς της επιστήμης και της τεχνολογίας, ως κοινωνικά και πολιτικά όντα υστερούμε ακόμα και σήμερα και αναγνωρίζουμε τους εαυτούς μας στο σημαντικό κείμενο του.\n\ \n\
Σκηνοθετικό σημείωμα:\n\ \n\
Θεσμοφοριάζουσες 2022: Σε καιρούς που δοκιμάζεται η δημοκρατία και κινδυνεύει η κοινωνική συνοχή, ανθίζει η δημιουργικότητα των μεγάλων ποιητών. Η Αθήνα του τέλους του 5ου αιώνα π.Χ. βρίσκεται με την πλάτη στον τοίχο. Μέσα από την «θέση» και τις «θέσεις» των γυναικών, με αφορμή μία γιορτή – τα Θεσμοφόρια – και καυτηριάζοντας την προκλητική στάση ανδρών, διανοουμένων και πολιτικολογούντων, με όχημα τις δραματουργικές παραξενιές του μεγάλου Ευριπίδη, ο εξίσου μεγάλος Αριστοφάνης μας αποκαλύπτει τα προτερήματα και τις αδυναμίες των προγόνων μας, που δεν διαφέρουν και πολύ από τις σημερινές.\n\ \n\
Όλα αυτά βέβαια, μέσα από την κωμική του καρδιά και διάθεση. Άλλωστε, το γέλιο είναι η μεγάλη παρηγοριά του λαού και οι μεγάλοι κωμικοί ποιητές είναι γνήσια λαϊκοί. Δηλαδή, μας κάνουν να θυμόμαστε και να ονειρευόμαστε ταυτόχρονα. Οι ψευτολαϊκοί απλώς κολακεύουν τις ευτελείς μας συνήθειες. (Γιάννης Μπέζος) ";

var perigrafi4 = "Η Μήδεια του Ευριπίδη, όπως την διασκεύασαν και την φαντάστηκαν o Αιμίλιος Χειλάκης και ο Μανώλης Δούνιας με την Αθηνά Μαξίμου στον ομώνυμο ρόλο θα περιοδεύσει στα ανοιχτά θέατρα της Αττικής και σε ολόκληρη την Ελλάδα το καλοκαίρι του 2022 με αφετηρία το θέατρο Πέτρας στις 29 Ιουνίου.\n\ \n\
Σε αυτό το ανέβασμα του σπαρακτικού έργου του παγκόσμιου θεάτρου, οι σκηνοθέτες ακολουθούν το πρότυπο της αρχαίας τραγωδίας που θέλει τρεις υποκριτές να υποδύονται όλα τα πρόσωπα του δράματος. Η Αθηνά Μαξίμου, ο Αιμίλιος Χειλάκης και ο Αναστάσης Ροϊλός αναλαμβάνουν τους ρόλους του έργου, ενώ στο Χορό συναντάμε δύο κορυφαίες: τη Γιώτα Νέγκα και τη Μυρτώ Αλικάκη.\n\ \n\
Το εμβληματικό έργο της αρχαίας ελληνικής γραμματείας παρουσιάζεται σε καινούργια μετάφραση του Γιώργου Μπλάνα και πρωτότυπη ζωντανή μουσική του Δημήτρη Καμαρωτού. Τα σκηνικά και τα κοστούμια υπογράφει η Εύα Νάθενα, την κίνηση επιμελείται η Πατρίσια Απέργη και τους φωτισμούς ο Νίκος Βλασόπουλος.\n\ \n\
Στο Χορό συναντάμε μερικούς από τους πιο ταλαντούχους ηθοποιούς και χορευτές της νέας γενιάς: Πετρίνα Γιαννάκου, Μάιρα Γραβάνη, Αλεξάνδρα Δρανδάκη, Γιώργος Ζυγούρης, Ελευθερία Κοντογεώργη, Εριέττα Μανούρη, Βασίλης Μπούτσικος, Γιώργος Νούσης, Δάφνη Σταθάτου. Μαζί τους επί σκηνής ο συνθέτης Δημήτρης Καμαρωτός.\n\ \n\
Στη Μήδεια ο έρωτας ανατρέπει τη λογική, μεταμορφώνει τους ανθρώπους, πολιορκεί ακόμη και τις πιο ιερές σχέσεις όπως αυτή ανάμεσα στη μητέρα και τα παιδιά της. Η Μήδεια σκοτώνει τα παιδιά της όχι απλώς για να εκδικηθεί τον Ιάσονα, αλλά κυρίως για να τα σώσει από τα χέρια των εχθρών της, για να μην επιτρέψει στην εξουσία να τα δολοφονήσει. Γι΄ αυτό ο Ευριπίδης –παρά την αποτρόπαια πράξη της- στο τέλος, αντί να την τιμωρήσει, την αποθεώνει.";

var contributors1 = 'Σκηνοθεσία: Βασίλης Μπισμπίκης \n\ \n\
Διασκευή-Δραματουργία: Βασίλης Μπισμπίκης, Χρήστος Νικολόπουλος \n\ \n\
Σκηνικά-Κοστούμια: Κένι ΜακΛέλαν \n\ \n\
Επιμέλεια κίνησης: Αγγέλα Πατσέλη \n\ \n\
Σχεδιασμός ήχου: Μάνος Πατεράκης \n\ \n\
Μουσικό θέμα έναρξης (διασκευή): Τάσος Σωτηράκης \n\ \n\
Φωτισμοί: Λάμπρος Παπούλιας \n\ \n\
Μακιγιάζ-Σχεδιασμός χτενισμάτων: Γιάννης Παμούκης \n\ \n\
Ειδικά εφέ: Προκόπης Βλασσερός \n\ \n\
Βοηθός σκηνοθέτη: Διονύσης Κοκκοτάκης \n\ \n\
Ηχολήπτης: Βασίλης Καραγιάννης \n\ \n\
Φωτογραφίες: Γιώργος Καλφαμανώλης \n\ \n\
Διεύθυνση παραγωγής: Φαίη Τζήμα \n\ \n\
Υπεύθυνη επικοινωνίας Cartel Τεχνοχώρος: Μαρίκα Αρβανιτοπούλου \n\ \n\ \n\
Παίζουν (αλφαβητικά): Ερατώ Αγγουράκη, Λευτέρης Αγουρίδας, Ελεονώρα Αντωνιάδου, Μπέττυ Βακαλίδου, Δημήτρης Γαλάνης, Γιανμάζ Ερντάλ, \n\
 Μάρα Ζαλώνη, Μάνος Καζαμίας, Διονύσης Κοκκοτάκης, Δημήτρης Παπάζογλου, Αγγέλα Πατσέλη, Γιώργος Σιδέρης, Τάσος Σωτηράκης, Στέλιος Τυριακίδης, Πουριά Χοσσεϊνί ';

var contributors2 = 'Παίζουν: Νικήτας Τσακίρογλου, Μιχάλης Σαράντης, Αντίνοος Αλμπάνης, Θάνος Αλεξίου, Στέλιος Δημόπουλος, Μαρία Νεφέλη Δούκα, Τζένη Κόλλια, Φώτης Λαζάρου, Δάφνη Λιανάκη, Ευθύμης Ξυπολιτάς, Παναγιώτα Παπαδημητρίου, Αντώνης Τσιοτσιόπουλος, Κώστας Φυτίλης, Aντώνης Χρήστου\n\ \n\
Μουσικοί επί σκηνής: Αθηνόδωρος Καρκαφίρης & Βαγγέλης Παρασκευαΐδης\n\ \n\ \n\ \n\
ΤΑΥΤΟΤΗΤΑ ΠΑΡΑΣΤΑΣΗΣ\n\ \n\
Σκηνοθεσία: Γιώργος Παλούμπης\n\ \n\
Θεατρική προσαρμογή: Γιώργος Παλούμπης, Αντώνης Τσιοτσιόπουλος\n\ \n\
Σκηνικά: Νατάσσα Παπαστεργίου\n\ \n\
Φωτισμοί: Βασίλης Κλωτσοτήρας\n\ \n\
Μουσική σύνθεση: Κώστας Νικολόπουλος\n\ \n\
Σχεδιασμός ήχου-ηχοληψία: Χρήστος Λαμπρόπουλος\n\ \n\
Βοηθός Σκηνοθέτη: Γιώργος Λόξας\n\ \n\
Κοστούμια: Έλενα Γιαννίτσα, Νατάσσα Παπαστεργίου\n\ \n\
Βοηθός σκηνογράφου: Μαρία Σιαβίκη\n\ \n\
Επιμέλεια κίνησης: Βρισηίδα Σολωμού\n\ \n\
Βοηθός ενδυματολόγου: Τζούλια Κατζηλέλη\n\ \n\
Φιγούρες Θεάτρου Σκιών: Σπύρος Αγγελόπουλος\n\ \n\
Οργάνωση παραγωγής: Χρυσαντίνα Κούλουμπου, Μικαέλα Καρή\n\ \n\
Εκτέλεση παραγωγής: Κίμων Σοφικίτης\n\ \n\
Διεύθυνση παραγωγής: Τάκης Γεώργας, Γιώργος Γεώργας\n\ \n\
Επικοινωνία : Μαρία Αδαμοπούλου, Ελένη Λίλη, Χαρούλα Λώλη\n\ \n\
Παραγωγή: Gr Entertainment World Ltd\n\ \n\
Χειρισμός βιντεοπροβολων: Σοφία Σάτου\n\ \n\
Τεχνικός σκηνής: Αντώνης Ανδρουλιδάκης\n\ \n\
Φωτογραφίες: Σταύρος Χαμπάκης\n\ \n\
Βίντεο promo και θεάτρου σκιών: Θωμάς Παλυβός\n\ \n\ \n\ \n\
Κατασκευή σκηνικών: Μιχάλης Λαγκουβάρδος, Παναγιώτης Λαλουδάκης';

var contributors3 = "Διανομή:\n\ \n\ \n\ \n\
Μνησίλοχος: Γιάννης Μπέζος\n\ \n\
Ευριπίδης: Βλαδίμηρος Κυριακίδης\n\ \n\
Κρίτυλλα: Φωτεινή Μπαξεβάνη\n\ \n\
Αγάθωνας/Τοξότης: Λαέρτης Μαλκότσης\n\ \n\
Χορός: Νίκη Σερέτη\n\ \n\
Χορός: Γιάννα Παπαγεωργίου\n\ \n\
Κλεισθένης: Παναγιώτης Κατσώλης\n\ \n\
Χορός: Αρετή Πασχάλη\n\ \n\
Χορός: Λήδα Καπνά\n\ \n\
Υπηρέτης: Αλέξης Βιδαλάκης\n\ \n\
Πρύτανης: Σταύρος Μαρκάλας\n\ \n\
Χορός: Ντένια Στασινοπούλου\n\ \n\
Χορός: Κωνσταντίνα Νταντάμη\n\ \n\
Χορός: Αγγελική Γρηγοροπούλου\n\ \n\
Χορός: Eλένη Ζαχοπούλου\n\ \n\
Χορός: Μανταλένα Καραβάτου\n\ \n\
Συντελεστές:\n\ \n\ \n\ \n\
Μετάφραση: Μύρης (Κ. Γεωργουσόπουλος)\n\ \n\
Σκηνοθεσία: Γιάννης Μπέζος\n\ \n\
Πρωτότυπη μουσική – σύνθεση: Φοίβος Δεληβοριάς\n\ \n\
Ενορχήστρωση: Σταμάτης Σταματάκης\n\ \n\
Σκηνικά: Γιώργος Γαβαλάς\n\ \n\
Κοστούμια: Βασιλική Σύρμα\n\ \n\
Κίνηση: Σεσίλ Μικρούτσικου\n\ \n\
Φωτισμοί: Χρήστος Τσιόγκας\n\ \n\
Φωτογραφίες, βίντεο: Δημήτρης Μακρής\n\ \n\
Μουσική διδασκαλία: Νεφέλη Φασουλή\n\ \n\
Παραγωγή: Θεατρικές Επιχειρήσεις Τάγαρη\n\ \n\
Οργάνωση παραγωγής: Ντόρα Βαλσαμάκη ";

var contributors4 = "Μετάφραση: Γιώργος Μπλάνας\n\ \n\
Σκηνοθεσία - Διασκευή: Αιμίλιος Χειλάκης – Μανώλης Δούνιας\n\ \n\
Πρωτότυπη Μουσική – Διδασκαλία Χορικών: Δημήτρης Καμαρωτός\n\ \n\
Σκηνικά- Κοστούμια: Εύα Νάθενα\n\ \n\
Κίνηση - Χορογραφία: Πατρίσια Απέργη\n\ \n\
Φωτισμοί: Νίκος Βλασόπουλος\n\ \n\
Λογοθεραπεία - αγωγή λόγου: Ηλίας Παπαθανασίου\n\ \n\
Βοηθός Σκηνοθετών: Νίκος Τσιμάρας\n\ \n\
Βοηθός Σκηνογράφου-Ενδυματολόγου: Δάφνη-Χρυσή Φωτεινάτου\n\ \n\
Βοηθός Χορογράφου: Εμμανουέλα Σακελλάρη\n\ \n\
Φωτογραφίες: Μαριλένα Αναστασιάδου\n\ \n\
Μακιγιάζ: Σίσσυ Πετροπούλου\n\ \n\ \n\ \n\
Διεύθυνση παραγωγής: Έφη Πανουργιά\n\ \n\
Εκτέλεση παραγωγής: Γιάννης Κουλούρης\n\ \n\
Υπεύθυνη περιοδείας: Αλεξάνδρα Κούζουνα\n\ \n\
Social Media -Διαφήμιση: Renegade Media / Βασίλης Ζαρκαδούλας\n\ \n\
Παραγωγή: ΘΕΑΤΡΟΧΩΡΟΣ ΕΕ";

var eventName = ["ΚΟΚΚΙΝΑ ΦΑΝΑΡΙΑ", "ΜΑΤΩΜΕΝΑ ΧΩΜΑΤΑ", "ΘΕΣΜΟΦΟΡΙΑΖΟΥΣΕΣ του Αριστοφάνη", "Μήδεια", "Μήδεια"];
var eventDescription = [perigrafi1, perigrafi2, perigrafi3, perigrafi4, perigrafi4];
var eventTotal_seats = [100, 150, 180, 200, 120];
var eventOrganizer = ["Ομάδα Cartel", "GR ENTERTAINMENT WORLD LTD", "ΑΦΟΙ ΤΑΓΑΡΗ ΟΕ", "ΘΕΑΤΡΟΧΩΡΟΣ ΕΤΕΡΟΡΡΥΘΜΗ ΕΤΑΙΡΙΑ", "ΘΕΑΤΡΟΧΩΡΟΣ ΕΤΕΡΟΡΡΥΘΜΗ ΕΤΑΙΡΙΑ"];
var eventDuration = [120, 160, 90, 100, 130];
var eventAdmin_id = [1, 1, 1, 2, 2];
var eventStart_date = ["10/06/2022", "12/06/2022", "14/06/2022", "15/06/2022", "20/06/2022"];
var eventStart_time = ["20:00", "22:00", "21:30", "20:30", "21:00",];
var eventImg = ["https://www.viva.gr/tickets/getattachment/c7fceeb3-d36c-4fd2-bda7-9eb5a6233816/%ce%9a%ce%9f%ce%9a%ce%9a%ce%99%ce%9d%ce%91-%ce%a6%ce%91%ce%9d%ce%91%ce%a1%ce%99%ce%9118c2e6f2-aea8-4c5e-b24f-213e7cc29c1.png",
    "https://www.viva.gr/tickets/getattachment/791aac50-97da-4248-bdd3-5c70c390b211/%ce%9c%ce%91%ce%a4%ce%a9%ce%9c%ce%95%ce%9d%ce%91-%ce%a7%ce%a9%ce%9c%ce%91%ce%a4%ce%91c477ae9d-87eb-4766-ba06-a3166f8b5da.png",
    "https://www.viva.gr/tickets/getattachment/09d430ed-d622-45a4-a63f-cff62da7c61e/%ce%98%ce%95%ce%a3%ce%9c%ce%9f%ce%a6%ce%9f%ce%a1%ce%99%ce%91%ce%96%ce%9f%ce%a5%ce%a3%ce%95%ce%a3-%cf%84%ce%bf%cf%85-%ce%91%cf%81%ce%b9%cf%83%cf%84%ce%bf%cf%86%ce%b1%ce%bd%ce%b78d157427-c5c0-411d-.png",
    "https://www.viva.gr/tickets/getattachment/9030b144-3dad-4431-913b-c7482d0dad71/%ce%9c%ce%b7%ce%b4%ce%b5%ce%b9%ce%b18f521818-f20c-4722-9a78-cfe1293da6d5.png",
    "https://www.viva.gr/tickets/getattachment/9030b144-3dad-4431-913b-c7482d0dad71/%ce%9c%ce%b7%ce%b4%ce%b5%ce%b9%ce%b18f521818-f20c-4722-9a78-cfe1293da6d5.png"];
var eventContributor = [contributors1, contributors2, contributors3, contributors4, contributors4];
var eventPrice = [15, 20, 18, 13, 10];
var eventPhone = ["2610123456", "2610123456", "2610123456", "2610123456", "2610123456",];
var eventPlace = ["Royal Theater", "Act Theater", "National Theater", "Crete Theater", "Royal Theater"]



for (let i = 0; i < eventName.length; i++) {

    let stmt = sql.prepare("INSERT INTO event VALUES (null, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)");
    stmt.run(eventName[i], eventDescription[i], eventTotal_seats[i], eventOrganizer[i], eventDuration[i], eventAdmin_id[i], eventStart_date[i], eventStart_time[i], eventImg[i], eventContributor[i], eventPrice[i], eventPhone[i], eventPlace[i]);
}

